app/controllers/roles_controller.rb

  def update
    #    @role = Role.find(params[:id])
    #
    #    respond_to do |format|
    #      if @role.update_attributes(params[:role])
    #        flash[:notice] = 'Role was successfully updated.'
    #        format.html { redirect_to(@role) }
    #        format.xml  { head :ok }
    #      else
    #        format.html { render :action => "edit" }
    #        format.xml  { render :xml => @role.errors, :status => :unprocessable_entity }
    #      end
    #    end
    @user=User.find(params[:user_id])
    @role=Role.find(params[:id])
---
SELECT * FROM `roles` WHERE (`roles`.`id` = 953125641)

  def destroy
#    @role = Role.find(params[:id])
#    @role.destroy
#
#    respond_to do |format|
#      format.html { redirect_to(roles_url) }
#      format.xml  { head :ok }
#    end
#  end
    @user=User.find(params[:user_id])
    @role=Role.find(params[:id])
    if @user.has_role?(@role.name)
      @user.roles.delete(@role)
---
SELECT * FROM `roles` WHERE (`roles`.`id` = 953125641)
DELETE FROM `roles` WHERE `id` = 953125641