app/controllers/users_controller.rb

  def create
    @user = User.new(params[:user])
    respond_to do |format|

      if @user.save
---
INSERT INTO `users` (`last_login_at`, `updated_at`, `hashed_password`, `profile`, `username`, `enabled`, `email`, `created_at`) VALUES(NULL, '2009-10-20 11:19:58', '6ca13d52ca70c883e0f0bb101e425a89e8624de51db2d2392593af6a84118090', 'A regular guy', 'fred', 1, 'fred@example.com', '2009-10-20 11:19:58')